In [2]:
import numpy as np
import pandas as pd

In [6]:
dict1={
       "name"  : ['harry','mini','sofia','us'],
       "marks" : [30,53,87,76],
       "add" : ['India','argentina','finland','france']
        }

In [7]:
df=pd.DataFrame(dict1)

In [8]:
df

    name  marks        add
0  harry     30      India
1   mini     53  argentina
2  sofia     87    finland
3     us     76     france

In [10]:
df.to_csv('report.csv')

In [11]:
df.to_csv('report_index_false.csv',index=False)

In [12]:
df.head(2)

    name  marks        add
0  harry     30      India
1   mini     53  argentina

In [13]:
df.tail(3)

    name  marks        add
1   mini     53  argentina
2  sofia     87    finland
3     us     76     france

In [14]:
df.describe()

          marks
count   4.00000
mean   61.50000
std    25.33114
min    30.00000
25%    47.25000
50%    64.50000
75%    78.75000
max    87.00000

In [15]:
p=pd.read_csv('p.csv')

In [16]:
p

   trainno  speed        add
0      123     30      India
1       44     53  argentina
2      245     87    finland
3     3535     56     france

In [17]:
p['speed'][0]=70

C:\Users\Dell\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [24]:
mylist=[5.6,6.1,1.4,0.5]
myarray=np.array(mylist)
print(myarray)

[5.6 6.1 1.4 0.5]

In [25]:
myseries=pd.Series(data=mylist)
print(myseries)

0    5.6
1    6.1
2    1.4
3    0.5
dtype: float64

In [26]:
mylabel=["first","second","third","fourth"]
myseries2=pd.Series(data=mylist,index=mylabel)
print(myseries2)

first     5.6
second    6.1
third     1.4
fourth    0.5
dtype: float64

In [23]:
myseries3=pd.Series([6.7,5.3,7.8,3.3],["first","second","third","fourth"])
print(myseries3)

first     6.7
second    5.3
third     7.8
fourth    3.3
dtype: float64

In [27]:
print(myseries2+myseries3)

first     12.3
second    11.4
third      9.2
fourth     3.8
dtype: float64

In [28]:
#we can create a new dataframe
df2= pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0 -1.311486  0.279842  0.362020 -0.194519  0.916581
1 -0.379505  0.576203  0.481099 -0.012027  1.395106
2 -1.524669 -2.287999  1.387001 -0.616151  0.552662
3  0.216196 -0.926974 -0.481437 -1.110413 -0.038341
4  0.655726  0.180026  0.429657  1.066825  1.484194

In [33]:
df3= pd.DataFrame(np.random.randn(5,5), index= ['first row','second row','thired row','fourth row','fifth row'],
                  columns=['first col','second col','thired col','fourth col','fifth col'])
df3

            first col  second col  thired col  fourth col  fifth col
first row   -1.715480   -0.355244   -0.336934   -0.534409   0.274654
second row   0.460354   -2.613325   -1.766645   -0.153831  -0.921835
thired row   0.680734    1.132076   -1.832902    0.605683   0.884612
fourth row   0.859522   -0.145560    0.582809   -0.203609  -1.347811
fifth row    1.297429    1.065408   -0.078669   -1.285113  -0.048370

In [37]:
#we can access individual series in a data frame
print(df3['second col'])
print('')
df3[['thired col','first col']]

first row    -0.355244
second row   -2.613325
thired row    1.132076
fourth row   -0.145560
fifth row     1.065408
Name: second col, dtype: float64

            thired col  first col
first row    -0.336934  -1.715480
second row   -1.766645   0.460354
thired row   -1.832902   0.680734
fourth row    0.582809   0.859522
fifth row    -0.078669   1.297429

In [41]:
#we can acress rows of a dataframe
df3.loc['fourth row']

first col     0.859522
second col   -0.145560
thired col    0.582809
fourth col   -0.203609
fifth col    -1.347811
Name: fourth row, dtype: float64

In [42]:
df3.iloc[2]

first col     0.680734
second col    1.132076
thired col   -1.832902
fourth col    0.605683
fifth col     0.884612
Name: thired row, dtype: float64

In [49]:

df3>0

            first col  second col  thired col  fourth col  fifth col
first row       False       False       False       False       True
second row       True       False       False       False      False
thired row       True        True       False        True       True
fourth row       True       False        True       False      False
fifth row        True        True       False       False      False

In [47]:
#we can access rows of  a dataframe
df3.loc['fourth row']

first col     0.859522
second col   -0.145560
thired col    0.582809
fourth col   -0.203609
fifth col    -1.347811
Name: fourth row, dtype: float64